[
  {
    "label": "Hero",
    "description": "A protagonist who accepts responsibility for others and the outcome of their world. Often paired with courage or discipline, yet vulnerable to fatal flaws like hubris. Reputation may be heroic while a destabilizing secret tests whether self‑interest or the greater good wins."
  },
  {
    "label": "Antihero",
    "description": "A central figure whose methods or ethics are compromised but whose goals still matter. Generates strong internal conflict (duty vs. desire) and usually carries a painful backstory; destiny skews bittersweet and reputation swings between infamous and indispensable."
  },
  {
    "label": "Mentor",
    "description": "A guide whose wisdom accelerates a protagonist’s growth. Their authority stems from occupation (scholar, veteran, mystic); a hidden failing or past error can pivot mid‑plot and force the pupil to stand alone."
  },
  {
    "label": "Trickster",
    "description": "A disruptor who breaks rules and exposes hypocrisy. Positive wit clashes with impulsiveness; secrets are weapons. Destiny tends toward irony as reputation toggles between clown and genius."
  },
  {
    "label": "Caregiver",
    "description": "A protector who prioritizes others’ well‑being. Motivated by love or duty; common fatal flaws include self‑neglect or martyrdom. Occupations like healer or teacher provide practical stakes under external pressure."
  },
  {
    "label": "Ruler",
    "description": "A power‑holder balancing stability and justice. Driven by legacy or control, with pride as a classic flaw. Reputation becomes political currency while succession secrets and coups reshape destiny."
  },
  {
    "label": "Rebel",
    "description": "Challenges norms and oppression. Motivations of freedom or justice align with external conflicts against authority; bravery collides with recklessness and destiny arcs from reluctant leader to tragic martyr."
  },
  {
    "label": "Sage",
    "description": "Seeker of knowledge and meaning. Occupations (scholar, oracle) tie to curiosity; flaws include detachment or arrogance. Forbidden knowledge as a secret can raise catastrophic stakes and force action."
  },
  {
    "label": "Innocent",
    "description": "Defined by purity, hope, or naïveté. Trust and optimism invite empathy while gullibility creates danger. Destiny often explores coming‑of‑age as reputation shifts from sheltered to symbol."
  },
  {
    "label": "Explorer",
    "description": "Driven to cross boundaries—geographic, social, or intellectual. Discovery and freedom clash with external constraints; resourcefulness offsets restlessness. Backstories often feature confining origins."
  },
  {
    "label": "Everyman",
    "description": "An ordinary person thrust into extraordinary stakes. Relatable strengths like resilience fight self‑doubt. Reputation begins low and transforms as common virtue meets uncommon pressure."
  },
  {
    "label": "Lover",
    "description": "Seeks connection and union. Devotion collides with duty or ambition; fatal flaws include jealousy or idealization. Secrets like forbidden love can dominate social stakes and reputation."
  },
  {
    "label": "Creator",
    "description": "An innovator who brings new things into being. Motivation for legacy or expression meets external resistance (patronage, censorship). Flaws like perfectionism risk sacrificing relationships."
  },
  {
    "label": "Magician",
    "description": "A transformer who bends reality or systems. Motivated by mastery or healing but prone to control and hubris. Taboo rites as secrets and heretic/savior reputations shape rise or fall."
  },
  {
    "label": "Jester",
    "description": "A truth‑teller cloaked in humor. Levity and social intelligence can mask fear or avoidance. Destiny hinges on whether laughter disarms tyranny or trivializes danger."
  },
  {
    "label": "Warrior",
    "description": "Solves problems through force and discipline. Honor or protection motivates; rigidity or anger creates internal battles. Destiny questions what is worth fighting for."
  },
  {
    "label": "Healer",
    "description": "Restores bodies, minds, or systems. Mercy clashes with scarcity or corruption; flaws include savior complex or burnout. Illicit methods as secrets test reputation and ethics."
  },
  {
    "label": "Guardian",
    "description": "A sentinel bound to a person, place, or vow. Duty competes with desire; sacrifice haunts destiny. External conflict places them at choke points; loyalty defines internal struggle."
  },
  {
    "label": "Outlaw",
    "description": "A lawbreaker by necessity or conviction. Seeks freedom or survival while opposing institutions; infamous reputation may hide a code. Cynicism tempts tragic outcomes."
  },
  {
    "label": "Detective",
    "description": "A pattern‑breaker who solves mysteries. Pursues truth and justice under pressure from secrecy and corruption. Obsession strains relationships; credibility binds occupation and reputation."
  },
  {
    "label": "Scholar",
    "description": "A theorist whose weapon is understanding. Curiosity conflicts with action; paralysis by analysis is a risk. Lost texts and hidden data turn knowledge into plot‑level stakes."
  },
  {
    "label": "Artist",
    "description": "A shaper of culture and emotion. Expression collides with patronage and poverty; volatility or narcissism may sabotage ties. Reputation swings can make or break careers."
  },
  {
    "label": "Priest/Cleric",
    "description": "Mediator between people and the sacred. Service and order meet politics and heresy; fanaticism or hypocrisy are explosive flaws. Institutional secrets can topple regimes."
  },
  {
    "label": "Merchant",
    "description": "Broker of value and networks. Wealth or influence motivate; avarice erodes trust. Reputation and secret deals define external stakes in markets and courts alike."
  },
  {
    "label": "Leader",
    "description": "Coordinates people and strategy without sovereign title. Seeks impact but may over‑control; destiny tests whether they build community or cult."
  },
  {
    "label": "Strategist",
    "description": "Wins through foresight and systems thinking. Craves elegant solutions; coldness strains relationships. Misreading secrets or reputations collapses intricate plans."
  },
  {
    "label": "Diplomat",
    "description": "Bridge‑builder across factions. Pursues peace or leverage in negotiation arenas; appeasement can backfire and secrets ruin credibility."
  },
  {
    "label": "Spy",
    "description": "Lives in ambiguity to gather secrets. Motivation (cause or survival) entangles with identity; duplicity fatigue is common and destiny forces a choice between truth and self."
  },
  {
    "label": "Assassin",
    "description": "Professional killer with a code or cause. Justice or coin collides with conscience; desensitization or remorse drives internal collapse. Reputation is precise, fearsome, isolating."
  },
  {
    "label": "Thief",
    "description": "Infiltrator who redistributes or hoards. Liberation, thrill, or need clash with law and trust. Greed and compulsion are common risks; true loyalties stay hidden."
  },
  {
    "label": "Ranger/Tracker",
    "description": "Solitary scout between wild and civilized. Stewardship and freedom meet threats from nature and encroachment; isolation limits bonds and destiny weighs wilderness vs. belonging."
  },
  {
    "label": "Judge",
    "description": "Arbiter of law and fairness. Justice collides with politics; rigidity or bias complicate verdicts. Tainted secrets delegitimize entire systems."
  },
  {
    "label": "Visionary",
    "description": "Future‑oriented catalyst who sees possibilities. Transformation fights inertia; grandiosity risks collapse. Fate measures whether vision becomes movement or madness."
  },
  {
    "label": "Engineer/Tinkerer",
    "description": "Builds mechanisms and processes to solve problems. Efficiency and curiosity meet resource limits; tunnel vision risks harm. Dangerous prototypes make secrets volatile."
  },
  {
    "label": "Pirate",
    "description": "Raider outside legal orders. Plunder, freedom, or revenge fuel conflict with navies and merchants; mutiny shadows destiny and a fearsome reputation both attracts and imperils crews."
  },
  {
    "label": "Nomad",
    "description": "Mover who resists roots. Freedom or survival confronts pressures to settle; restlessness sabotages ties. Destiny asks whether home is a place or a path."
  },
  {
    "label": "Prophet/Seer",
    "description": "Bearer of visions or warnings. Truth meets disbelief; certainty alienates allies. Misread omens as secrets can doom many."
  },
  {
    "label": "Alchemist",
    "description": "Seeks transformation through experiment and synthesis. Perfection edges toward obsession; forbidden methods escalate peril. Destiny balances discovery against cost."
  },
  {
    "label": "Bard",
    "description": "Storyteller whose voice shapes memory and morale. Legacy or influence meets censorship; embellishment erodes trust. Reputation is currency on every road."
  },
  {
    "label": "Witch/Warlock",
    "description": "Liminal practitioner bound to hidden powers. Power or protection collides with fear and persecution; bargains and corruption threaten existentially while secrecy defines survival."
  }
]