[
  {
    "label": "Hero",
    "description": "A protagonist who accepts responsibility for others and the outcome of the world around them. Pairs cleanly with positive traits like courage or discipline, but can be undercut by fatal flaws such as hubris. A heroic reputation may conceal a destabilizing secret; destiny often tests whether the hero sacrifices self-interest for the larger good."
  },
  {
    "label": "Antihero",
    "description": "A central character whose ethics or methods are compromised, yet who pursues a goal the audience cares about. Antiheroes generate potent internal conflict (duty vs. desire) and often carry heavy backstory wounds. Destiny tends to be bittersweet; reputation swings between infamous and indispensable."
  },
  {
    "label": "Mentor",
    "description": "A guide whose wisdom accelerates the protagonist’s growth. Their occupation (scholar, veteran, mystic) frames their authority; motivation may be redemption for past failures. A mentor’s secret or failing can turn mid-plot, transforming external conflict and forcing the pupil to stand alone."
  },
  {
    "label": "Trickster",
    "description": "A disruptor who breaks rules, exposes hypocrisy, and catalyzes change. Tricksters work best when their positive trait (wit) clashes with a negative trait (impulsiveness). Their destiny is often ironic; reputation toggles between clown and genius, and secrets are weapons."
  },
  {
    "label": "Caregiver",
    "description": "A protector who prioritizes the well-being of others. Motivation commonly arises from love or duty; fatal flaws include self-neglect or martyrdom. Their occupation (healer, teacher, guardian) gives practical stakes; external conflict tests boundaries of compassion."
  },
  {
    "label": "Ruler",
    "description": "A power-holder who must balance stability and justice. Motivation often centers on legacy or control; the fatal flaw is frequently pride. Reputation becomes a political currency; secrets (illegitimate heir, coup) reshape destiny and drive systemic external conflict."
  },
  {
    "label": "Rebel",
    "description": "A challenger of norms and oppressive systems. Motivation (freedom, justice) aligns with external conflict against authority. Positive traits (bravery) collide with negative ones (recklessness). Destiny arcs from insurgent to reluctant leader—or to tragic martyr."
  },
  {
    "label": "Sage",
    "description": "A seeker of knowledge and meaning. Their occupation (scholar, oracle) ties to curiosity as motivation; flaws include detachment or arrogance. Secrets (forbidden knowledge) can create catastrophic external stakes; destiny often tests whether wisdom yields action."
  },
  {
    "label": "Innocent",
    "description": "A character defined by purity, hope, or naiveté. Positive traits (trust, optimism) invite audience empathy; flaws (gullibility) create vulnerability. Destiny frequently explores coming-of-age; reputation may shift from sheltered to symbol."
  },
  {
    "label": "Explorer",
    "description": "One driven to cross boundaries—geographic, social, or intellectual. Motivation (discovery, freedom) clashes with external constraints; positive traits (resourcefulness) are tempered by flaws (restlessness). Backstory often includes a confining origin."
  },
  {
    "label": "Everyman",
    "description": "An ordinary person thrust into extraordinary circumstances. Strengths include resilience and relatability; flaws often involve self-doubt. Reputation starts low but can transform; destiny examines how common virtue meets uncommon pressure."
  },
  {
    "label": "Lover",
    "description": "One who seeks connection, intimacy, or union. Motivation (belonging, devotion) collides with duty or ambition. Fatal flaws include jealousy or idealization. Secrets (forbidden love) and reputations (scandalous vs. steadfast) drive social stakes."
  },
  {
    "label": "Creator",
    "description": "An innovator who brings new things into being. Motivation (legacy, expression) meets external resistance (patronage, censorship). Flaws include obsession or perfectionism; destiny often weighs art against relationships."
  },
  {
    "label": "Magician",
    "description": "A transformer who bends reality or systems. Motivation (mastery, healing) can veer into control; fatal flaw is hubris. Secrets (taboo rites) and reputation (savior vs. heretic) shape their rise or fall."
  },
  {
    "label": "Jester",
    "description": "A truth-teller cloaked in humor. Positive traits (levity, social intelligence) mask fear or avoidance. Their destiny hinges on whether laughter disarms tyranny or trivializes danger; reputations are volatile but powerful."
  },
  {
    "label": "Warrior",
    "description": "A combatant who solves problems through force and discipline. Motivation (honor, protection) pairs with occupations (soldier, guard). Flaws (rigidity, anger) invite internal battles; destiny questions what is worth fighting for."
  },
  {
    "label": "Healer",
    "description": "A restorer of bodies, minds, or systems. Motivation (mercy) clashes with scarcity or corruption. Flaws include savior complex or burnout; secrets (illicit methods) test reputation and ethical lines."
  },
  {
    "label": "Guardian",
    "description": "A sentinel bound to a person, place, or vow. Motivation (duty) competes with desire; destiny often involves sacrifice. External conflict places them at choke points; internal conflict examines where loyalty ends."
  },
  {
    "label": "Outlaw",
    "description": "A lawbreaker by necessity or conviction. Motivation (freedom, survival) opposes institutions; reputation (infamous) may conceal a personal code. Fatal flaws include cynicism; destiny toggles between folk hero and felon."
  },
  {
    "label": "Detective",
    "description": "A solver of mysteries and pattern-breaker. Motivation (truth, justice) is pressured by secrets and corruption. Flaws (obsession) can destroy relationships; occupation and reputation intertwine with credibility."
  },
  {
    "label": "Scholar",
    "description": "A theorist whose weapon is understanding. Motivation (curiosity) can conflict with action; flaw (paralysis by analysis). Secrets (lost texts) create external stakes; destiny tests whether knowledge changes the world."
  },
  {
    "label": "Artist",
    "description": "A shaper of culture and emotion. Motivation (expression, meaning) collides with patronage or poverty. Flaws include narcissism or volatility; reputation can swing wildly and affect all relationships."
  },
  {
    "label": "Priest/Cleric",
    "description": "A mediator between people and the sacred. Motivation (service, order) meets external conflict (heresy, politics). Fatal flaws (fanaticism, hypocrisy) are explosive; secrets can topple institutions."
  },
  {
    "label": "Merchant",
    "description": "A broker of value and networks. Motivation (wealth, influence) intersects with diplomacy. Flaws (avarice) threaten trust; reputation and secret deals define external stakes."
  },
  {
    "label": "Leader",
    "description": "A coordinator of people and strategy without sovereign power. Motivation (impact) and flaw (control) contest; destiny examines whether the leader builds community or cult."
  },
  {
    "label": "Strategist",
    "description": "A planner who wins by foresight. Motivation (elegant solutions) clashes with chaos; flaw (coldness) strains relationships. Their fate depends on reading secrets and reputations correctly."
  },
  {
    "label": "Diplomat",
    "description": "A bridge-builder across factions. Motivation (peace, leverage) meets external conflict in negotiation arenas. Flaws (appeasement) can backfire; secrets ruin credibility."
  },
  {
    "label": "Spy",
    "description": "A gatherer of secrets who lives in ambiguity. Motivation (country, cause, survival) entangles with identity. Fatal flaws include duplicity fatigue; destiny often forces a choice between truth and self."
  },
  {
    "label": "Assassin",
    "description": "A professional killer with a code or cause. Motivation (justice, coin) collides with conscience; fatal flaws (desensitization, remorse) drive internal collapse. Reputation is precise, fearsome, isolating."
  },
  {
    "label": "Thief",
    "description": "An infiltrator who redistributes or hoards. Motivation (liberation, thrill, need) clashes with law and trust. Flaws (greed, compulsion) are common; secrets (who they really steal for) matter."
  },
  {
    "label": "Ranger/Tracker",
    "description": "A solitary scout between wild and civilized. Motivation (stewardship, freedom) meets external threats from nature or encroachment. Flaws (isolation) limit bonds; destiny weighs wilderness against belonging."
  },
  {
    "label": "Judge",
    "description": "An arbiter of law and fairness. Motivation (justice) collides with politics; flaw (rigidity, bias) complicates cases. Secrets taint verdicts; reputation can legitimize or delegitimize entire systems."
  },
  {
    "label": "Visionary",
    "description": "A future-oriented catalyst who sees possibilities. Motivation (transformation) fights inertia; flaw (grandiosity) risks collapse. Destiny measures whether vision becomes cult, movement, or madness."
  },
  {
    "label": "Engineer/Tinkerer",
    "description": "A problem-solver who builds mechanisms and processes. Motivation (efficiency, curiosity) meets resource limits; flaw (tunnel vision) risks harm. Secrets (dangerous prototypes) escalate stakes."
  },
  {
    "label": "Pirate",
    "description": "A raider outside legal orders. Motivation (plunder, freedom, revenge) clashes with navies and merchants. Fatal flaw (mutiny bait) haunts them; reputation both attracts and imperils crews."
  },
  {
    "label": "Nomad",
    "description": "A mover who resists roots. Motivation (freedom, survival) meets external pressures to settle; flaw (restlessness) sabotages relationships. Destiny questions whether home is a place or a path."
  },
  {
    "label": "Prophet/Seer",
    "description": "A bearer of messages or visions. Motivation (truth, warning) collides with disbelief; fatal flaw (certainty) alienates allies. Secrets (misread omens) can doom many."
  },
  {
    "label": "Alchemist",
    "description": "A synthesizer who seeks transformation through experiment. Motivation (perfection) edges toward obsession; secrets (forbidden methods) create peril. Destiny balances discovery and cost."
  },
  {
    "label": "Bard",
    "description": "A storyteller whose voice shapes memory and morale. Motivation (legacy, influence) meets censorship or patronage. Flaw (embellishment) undermines trust; reputation is their currency."
  },
  {
    "label": "Witch/Warlock",
    "description": "A liminal practitioner bound to hidden powers. Motivation (power, protection) collides with fear and persecution. Fatal flaws (bargains, corruption) are existential; secrets define survival."
  }
]