[
  {
    "label": "Courageous",
    "description": "Acts despite fear, enabling decisive moves when stakes are high. Pairs with warrior or rebel archetypes; counters internal doubt and can rehabilitate damaged reputations."
  },
  {
    "label": "Compassionate",
    "description": "Feels and responds to others’ suffering. Supports caregiver/healer roles and can temper harsher motivations like revenge by reframing goals toward protection or mercy."
  },
  {
    "label": "Loyal",
    "description": "Prioritizes commitments to people or causes. Interlocks with destiny (oaths imply sacrifice) and conflicts with occupations that require duplicity such as espionage."
  },
  {
    "label": "Honest",
    "description": "Values truth even at cost. Creates friction with covert roles; builds durable reputations but invites external conflict with corrupt systems."
  },
  {
    "label": "Patient",
    "description": "Tolerates delay and hardship without rash action. Synergizes with strategist or mentor roles; may clash with rescue‑driven, time‑critical plots."
  },
  {
    "label": "Resourceful",
    "description": "Finds unconventional solutions under constraints. Enables underdogs and explorers; reframes external conflict as solvable puzzles."
  },
  {
    "label": "Humble",
    "description": "Understates ability, inviting trust and learning. Counters hubris as a fatal flaw and strengthens mentor‑mentee dynamics."
  },
  {
    "label": "Curious",
    "description": "Seeks knowledge and novelty. Fuels scholar/magician arcs; can conflict with secrets and spark plots by opening forbidden doors."
  },
  {
    "label": "Empathetic",
    "description": "Reads and resonates with emotions. Bolsters diplomat/leader roles and helps bridge factional divides despite reputational baggage."
  },
  {
    "label": "Resilient",
    "description": "Recovers from setbacks, sustaining motivation. Harmonizes with tragic backstories and helps outlast oppressive external forces."
  },
  {
    "label": "Creative",
    "description": "Generates fresh ideas or aesthetics. Amplifies creator/artist roles; reframes conflict through expression and design."
  },
  {
    "label": "Disciplined",
    "description": "Maintains focus and habits over time. Suits warrior/monk/engineer types; counterbalances impulsive teammates."
  },
  {
    "label": "Generous",
    "description": "Shares resources and credit. Enhances caregiver/leader reputations and challenges scarcity‑driven motivations."
  },
  {
    "label": "Diligent",
    "description": "Applies sustained care and effort. Supports precision roles (judge, engineer) and pays off in mastery arcs."
  },
  {
    "label": "Adaptable",
    "description": "Shifts tactics when conditions change. Vital for explorers and spies; mitigates rigid fatal flaws."
  },
  {
    "label": "Wise",
    "description": "Integrates knowledge with judgment. Powers mentor/sage roles; curbs rash motivations and avoids needless tragedy."
  },
  {
    "label": "Brave",
    "description": "Faces danger head‑on, often physically. Frequently the tipping point in external set‑pieces when time is short."
  },
  {
    "label": "Just",
    "description": "Balances competing claims impartially. Supports judge/ruler archetypes; collides with corrupt institutions and exposes secrets."
  },
  {
    "label": "Optimistic",
    "description": "Expects good outcomes, sustaining morale. Useful in bleak settings but may blind to risks, fueling internal tension with pragmatism."
  },
  {
    "label": "Strategic",
    "description": "Thinks in systems and horizons. Supports leader/strategist arcs and translates motivation into achievable plans."
  },
  {
    "label": "Charismatic",
    "description": "Inspires followership through presence and speech. Amplifies leader/ruler destinies; can mask flaws or secrets."
  },
  {
    "label": "Protective",
    "description": "Defends others instinctively. Powers guardian/healer arcs; escalates conflict when threats arise."
  },
  {
    "label": "Determined",
    "description": "Refuses to quit, converting motivation into action. Can tip into obsession if unbalanced by humility or reflection."
  },
  {
    "label": "Pragmatic",
    "description": "Chooses workable solutions over ideals. Harmonizes with engineer/merchant roles; clashes with zealotry."
  },
  {
    "label": "Reflective",
    "description": "Thinks deeply about choices and consequences. Defuses impulsive traits and strengthens internal arcs."
  },
  {
    "label": "Perceptive",
    "description": "Notices subtleties others miss. Core for detective/spy; exposes secrets and shifts reputations."
  },
  {
    "label": "Tolerant",
    "description": "Accepts difference without prejudice. Stabilizes diverse teams and counteracts bigoted forces."
  },
  {
    "label": "Gracious",
    "description": "Extends kindness in victory and loss. Softens reputational edges and supports healing after conflict."
  },
  {
    "label": "Forgiving",
    "description": "Releases justified resentment. Resolves internal arcs and can avert tragedy by breaking revenge loops."
  },
  {
    "label": "Open‑minded",
    "description": "Considers unfamiliar ideas fairly. Supports explorer/scholar roles and defuses culture‑clash conflicts."
  },
  {
    "label": "Dependable",
    "description": "Can be counted on under pressure. Builds reputation capital and offsets chaos‑prone teammates."
  },
  {
    "label": "Supportive",
    "description": "Elevates others’ performance. Enables mentor/leader dynamics and improves group outcomes."
  },
  {
    "label": "Tenacious",
    "description": "Clings to goals doggedly. Great for underdogs; can ossify into obsession (a fatal flaw) when unchecked."
  },
  {
    "label": "Altruistic",
    "description": "Sacrifices for others with minimal self‑interest. Pairs with hero/caregiver destinies; risks burnout."
  },
  {
    "label": "Cooperative",
    "description": "Works smoothly in teams. Reduces friction and amplifies collective strategy under stress."
  },
  {
    "label": "Decisive",
    "description": "Commits quickly with conviction. Crucial in crisis; can conflict with consensus‑driven cultures."
  },
  {
    "label": "Meticulous",
    "description": "Sweats details others ignore. Valuable in judge/engineer/detective roles; risk of paralysis if overused."
  },
  {
    "label": "Persuasive",
    "description": "Moves minds through argument or story. Key for diplomat/bard; ethically ambiguous when paired with dark aims."
  },
  {
    "label": "Playful",
    "description": "Uses humor and spontaneity to energize. Complements jester/trickster archetypes; can defuse or inflame tension."
  },
  {
    "label": "Innovative",
    "description": "Pushes boundaries to invent better ways. Pairs with creator/engineer; attracts resistance from tradition."
  },
  {
    "label": "Integrity‑driven",
    "description": "Aligns action with values despite cost. Strengthens reputation and resolves internal dissonance."
  },
  {
    "label": "Imaginative",
    "description": "Visualizes possibilities beyond constraints. Fuels visionary arcs; enables lateral solutions."
  },
  {
    "label": "Observant",
    "description": "Attends to people and environments keenly. Enhances scouting, investigation, and social inference."
  },
  {
    "label": "Self‑aware",
    "description": "Recognizes one’s own patterns and limits. Damps fatal flaws before escalation; deepens internal arcs."
  },
  {
    "label": "Steadfast",
    "description": "Holds course under pressure. Stabilizes teams and sustains campaigns; risks rigidity when paired with pride."
  },
  {
    "label": "Tactful",
    "description": "Speaks truth in ways others can hear. Empowers diplomacy and leadership; reduces reputational blowback."
  },
  {
    "label": "Intuitive",
    "description": "Trusts pattern‑sense and gut. Useful when data is sparse; tension arises when it contradicts analysis."
  },
  {
    "label": "Visionary",
    "description": "Sees trajectories and meaning others miss. Anchors movement‑building destinies; can clash with pragmatists."
  },
  {
    "label": "Grounded",
    "description": "Keeps perspective amid hype or panic. Balances charismatic teammates; protects against reputation swings."
  },
  {
    "label": "Sociable",
    "description": "Builds broad networks naturally. Unlocks resources and intel; increases exposure to exploitation and secrets."
  }
]