[
  {
    "label": "Courageous",
    "description": "Acts despite fear, enabling decisive moves when stakes are high. Pairs with warrior or rebel archetypes; offsets reputational damage and counters internal conflict rooted in doubt."
  },
  {
    "label": "Compassionate",
    "description": "Feels and responds to others’ suffering. Supports caregiver/healer roles and can temper harsher motivations (revenge) by reframing goals toward protection or mercy."
  },
  {
    "label": "Loyal",
    "description": "Prioritizes commitment to people or causes. Interlocks with destiny (oaths lead to sacrifice) and can conflict with secrets or occupations requiring duplicity (spy, diplomat)."
  },
  {
    "label": "Honest",
    "description": "Values truth even at cost. Creates friction with spy/assassin archetypes; builds strong reputations but may trigger external conflict with corrupt systems."
  },
  {
    "label": "Patient",
    "description": "Tolerates delay and hardship without rash action. Synergizes with strategist or mentor roles; may clash with motivations requiring speed (rescue under time crunch)."
  },
  {
    "label": "Resourceful",
    "description": "Finds unconventional solutions under constraints. Supports explorer/ranger, offsets lack of power or status, and reframes external conflict as solvable puzzles."
  },
  {
    "label": "Humble",
    "description": "Understates ability, inviting trust and learning. Counters hubris as a fatal flaw and strengthens mentor-mentee dynamics."
  },
  {
    "label": "Curious",
    "description": "Seeks knowledge and novelty. Fuels scholar/magician/archetypes; can conflict with secrets and trigger plot by opening forbidden doors."
  },
  {
    "label": "Empathetic",
    "description": "Reads and resonates with emotions. Bolsters diplomat/leader roles and mitigates reputational damage by building bridges across factions."
  },
  {
    "label": "Resilient",
    "description": "Recovers from setbacks, sustaining motivation across long arcs. Harmonizes with tragic backstories and helps characters outlast oppressive external forces."
  },
  {
    "label": "Creative",
    "description": "Generates fresh ideas or aesthetics. Amplifies creator/artist roles; can reframe external conflict into expressive action and supports visionary destinies."
  },
  {
    "label": "Disciplined",
    "description": "Maintains focus and habits over time. Suits warrior/monk/engineer types; counters impulsive flaws and stabilizes teams."
  },
  {
    "label": "Generous",
    "description": "Shares resources and credit. Enhances caregiver/leader reputations and challenges scarcity-driven motivations."
  },
  {
    "label": "Diligent",
    "description": "Applies sustained effort and care. Interlocks with occupations requiring precision (judge, engineer); destiny rewards diligence with mastery arcs."
  },
  {
    "label": "Adaptable",
    "description": "Shifts tactics when conditions change. Vital for explorers and spies; reduces risk from rigid fatal flaws."
  },
  {
    "label": "Wise",
    "description": "Integrates knowledge with judgment. Powers mentor/sage roles; can challenge rash motivations and prevent avoidable tragedy."
  },
  {
    "label": "Brave",
    "description": "Faces danger head-on. Similar to courage but more physical expression; often the tipping point in external conflict set pieces."
  },
  {
    "label": "Just/Fair",
    "description": "Balances competing claims impartially. Supports judge/ruler archetypes; collides with corrupt institutions and exposes secrets."
  },
  {
    "label": "Optimistic",
    "description": "Expects good outcomes, sustaining morale. Useful in bleak settings; may blind to risks (creating internal conflict with pragmatism)."
  },
  {
    "label": "Strategic",
    "description": "Thinks in systems and long horizons. Supports leader/strategist archetypes and reframes motivation into achievable plans."
  },
  {
    "label": "Charismatic",
    "description": "Inspires followership through presence and speech. Amplifies leader/ruler destinies; can mask flaws or secrets."
  },
  {
    "label": "Protective",
    "description": "Defends others instinctively. Powers guardian/healer arcs; can escalate external conflict when threats arise."
  },
  {
    "label": "Determined",
    "description": "Refuses to quit, converting motivation into action. Interacts with fatal flaws (obsession) and can tip into self-destruction if unbalanced."
  },
  {
    "label": "Pragmatic",
    "description": "Chooses workable solutions over ideals. Harmonizes with engineer/merchant roles; clashes with zealotry or prophetic certainty."
  },
  {
    "label": "Reflective",
    "description": "Thinks deeply about choices and consequences. Defuses impulsive traits and strengthens internal conflict arcs."
  },
  {
    "label": "Perceptive",
    "description": "Notices subtleties others miss. Core for detective/spy; exposes secrets and shifts reputations."
  },
  {
    "label": "Tolerant",
    "description": "Accepts difference without prejudice. Stabilizes diverse teams and counteracts bigoted external forces."
  },
  {
    "label": "Gracious",
    "description": "Extends kindness in victory and loss. Softens reputational edges and supports healing after conflict."
  },
  {
    "label": "Forgiving",
    "description": "Releases justified resentment. Resolves internal conflict arcs and can avert tragic destinies."
  },
  {
    "label": "Open‑minded",
    "description": "Considers unfamiliar ideas fairly. Supports explorer/scholar roles and defuses culture‑clash conflicts."
  },
  {
    "label": "Dependable",
    "description": "Can be counted on under pressure. Builds reputation capital and offsets chaos-prone teammates."
  },
  {
    "label": "Supportive",
    "description": "Elevates others’ performance. Enables mentor/leader dynamics and improves group outcomes."
  },
  {
    "label": "Tenacious",
    "description": "Clings to goals doggedly. Great for underdogs; can inflate to obsession (fatal flaw) when unchecked."
  },
  {
    "label": "Altruistic",
    "description": "Sacrifices for others with minimal self-interest. Pairs with caregiver/hero destinies like martyrdom; risks burnout."
  },
  {
    "label": "Cooperative",
    "description": "Works smoothly in teams. Mitigates internal conflict and amplifies collective strategy."
  },
  {
    "label": "Decisive",
    "description": "Commits to a course quickly with conviction. Crucial in crisis; can conflict with reflective or consensus-led cultures."
  },
  {
    "label": "Meticulous",
    "description": "Sweats details others ignore. Valuable in judge/engineer/detective roles; risk of paralysis if overused."
  },
  {
    "label": "Persuasive",
    "description": "Moves minds through argument or story. Key for diplomat/bard; ethically ambiguous when paired with dark motivations."
  },
  {
    "label": "Playful",
    "description": "Uses humor and spontaneity to energize. Complements jester/trickster archetypes; can defuse or inflame tension."
  },
  {
    "label": "Innovative",
    "description": "Pushes boundaries to invent better ways. Pairs with creator/engineer; invites external resistance from tradition."
  },
  {
    "label": "Integrity‑driven",
    "description": "Aligns action with values even when costly. Strengthens reputation and resolves internal dissonance."
  },
  {
    "label": "Imaginative",
    "description": "Visualizes possibilities beyond constraints. Fuels visionary arcs; enables lateral solutions in external conflict."
  },
  {
    "label": "Observant",
    "description": "Attends to people and environments keenly. Enhances scouting, investigation, and social inference."
  },
  {
    "label": "Self‑aware",
    "description": "Recognizes one’s own patterns and limits. Damps fatal flaws before they escalate; deepens internal arcs."
  },
  {
    "label": "Steadfast",
    "description": "Holds course under pressure. Stabilizes teams and sustains long campaigns; risk of rigidity when paired with pride."
  },
  {
    "label": "Tactful",
    "description": "Speaks truth in ways others can hear. Empowers diplomacy and leadership; reduces reputational blowback."
  },
  {
    "label": "Intuitive",
    "description": "Trusts pattern-sense and gut. Useful when data is sparse; tension arises when it contradicts analysis."
  },
  {
    "label": "Visionary",
    "description": "Sees trajectories and meaning others miss. Anchors movement-building destinies; can clash with pragmatists."
  },
  {
    "label": "Grounded",
    "description": "Keeps perspective amid hype or panic. Balances visionary or charismatic teammates; protects from swings in reputation."
  },
  {
    "label": "Sociable",
    "description": "Builds broad networks naturally. Unlocks resources and information; vulnerable to secrets/exploitation."
  }
]