[
  {
    "label": "Healer (Physician/Herbalist)",
    "description": "Restores bodies and morale under scarcity. Aligns with compassion and healing motivations, but risks burnout and martyr complex; reputation swings between saint and quack depending on outcomes and politics."
  },
  {
    "label": "Mercenary",
    "description": "Sells skill at arms to patrons. Clarifies wealth and survival motivations and tests honor under conflicting contracts; reputation is transactional and fragile."
  },
  {
    "label": "Priest/Cleric",
    "description": "Mediates the sacred and the social. Balances faith and order with real‑world power; hypocrisy or fanaticism can explode institutions."
  },
  {
    "label": "Thief",
    "description": "Specializes in acquisition without consent. Marries freedom and survival motivations to secrets and social reading; reputation is folk hero or parasite by audience."
  },
  {
    "label": "Noble (Courtier/Patrician)",
    "description": "Wields status capital rather than labor. Legacy and reputation become plot engines; destiny arcs test stewardship vs. decadence."
  },
  {
    "label": "Spy",
    "description": "Trades in information and misdirection. Truth and loyalty are constantly stress‑tested; unmasking is an ever‑present risk."
  },
  {
    "label": "Soldier/Guard",
    "description": "Holds lines between order and chaos. Honor and protection center the arc; institutional rot creates moral injury and internal conflict."
  },
  {
    "label": "Ranger/Scout",
    "description": "Operates between wilds and walls. Discovery and stewardship motivations mesh with adaptation; isolation is both asset and flaw."
  },
  {
    "label": "Artisan/Craftsperson",
    "description": "Creates useful or beautiful goods. Anchors legacy and mastery motivations; conflict arrives via scarcity, guild politics, or theft."
  },
  {
    "label": "Merchant/Factor",
    "description": "Brokers goods, routes, and influence. Wealth and progress meet ethics at scale; reputation hinges on fairness vs. exploitation."
  },
  {
    "label": "Judge/Magistrate",
    "description": "Arbitrates competing claims. Justice motives face secrets and pressure; rigidity or bias imperils legitimacy."
  },
  {
    "label": "Assassin",
    "description": "Kills to contract or cause. Justice and revenge blur; destiny squeezes conscience until something breaks—often the assassin."
  },
  {
    "label": "Scholar/Lecturer",
    "description": "Generates and transmits knowledge. Curiosity and legacy drift toward hubris when unmoored; stakes rise when truth threatens power."
  },
  {
    "label": "Engineer/Tinkerer",
    "description": "Solves material problems elegantly. Progress and mastery collide with resource and political limits; success redraws power maps."
  },
  {
    "label": "Bard/Performer",
    "description": "Shapes morale and memory. Reputation is livelihood; truth vs. embellishment is an ongoing ethical duel."
  },
  {
    "label": "Smuggler",
    "description": "Moves forbidden goods and people. Freedom and protection clash with law; reputation depends on whether the law serves justice."
  },
  {
    "label": "Diplomat",
    "description": "Trades words for peace or leverage. Unity and balance define success; secrets and appeasement are occupational hazards."
  },
  {
    "label": "Sailor/Navigator",
    "description": "Lives at the mercy of elements and charts. Discovery and survival motivations, chosen‑family dynamics, and shipboard law shape arcs."
  },
  {
    "label": "Hunter/Tracker",
    "description": "Feeds communities or culls threats. Protection motives meet ethical lines about what is deemed prey and who decides."
  },
  {
    "label": "Inquisitor/Inspector",
    "description": "Investigates heresy or crime with mandate. Truth and order risk cruelty without checks; reputation terrifies or reassures."
  },
  {
    "label": "Alchemist",
    "description": "Experiments at the edge of taboo. Transcendence and progress motivations meet forbidden‑knowledge hunger; outcomes can be civilization‑shaking."
  },
  {
    "label": "Courtesan/Companion",
    "description": "Navigates intimacy as craft and commerce. Security and agency motivations clash with stigma; information is a secondary currency."
  },
  {
    "label": "Archivist/Chronicler",
    "description": "Keeps memory against decay or propaganda. Truth and legacy contend with censorship; reputation flips with regimes."
  },
  {
    "label": "Warden/Jailer",
    "description": "Holds bodies and secrets. Order and security motivations, frequent moral injury; arcs ask what justice actually is."
  },
  {
    "label": "Explorer/Cartographer",
    "description": "Expands known edges. Discovery and glory motivate; colonial ethics and risk shadow every map."
  },
  {
    "label": "Farmer/Agrologist",
    "description": "Feeds civilizations. Stewardship and security motives; conflict rises from weather, pests, policy, and war’s requisitions."
  },
  {
    "label": "Blacksmith/Armorer",
    "description": "Makes the tools of survival and war. Legacy and pride motives; ethical weight of arming tyrants vs. rebels."
  },
  {
    "label": "Monk/Ascetic",
    "description": "Seeks clarity through discipline. Faith and transcendence motivate; rigidity or denial are ever‑present snares."
  },
  {
    "label": "Detective/Investigator",
    "description": "Reconstructs truth from fragments. Truth and justice collide with secrets; obsession is a constant hazard."
  },
  {
    "label": "Guildmaster",
    "description": "Orchestrates craftspeople and markets. Legacy and power motives; the character embodies the system they built and must choose reform or exploitation."
  },
  {
    "label": "Tavern‑Keeper/Innkeeper",
    "description": "Community node and rumor hub. Belonging and wealth motives; neutrality is fragile once stakes rise."
  },
  {
    "label": "Herald/Messenger",
    "description": "Carries news and treaties across borders. Unity and trust motives; reputation as reliable becomes the true passport."
  },
  {
    "label": "Architect/City‑Planner",
    "description": "Shapes how people live together. Progress and legacy motives; politics and disasters test ethics at scale."
  },
  {
    "label": "Beast‑Keeper/Falconer",
    "description": "Bonds with the non‑human. Protection and nature motives; empathy extends beyond people, complicating choices in war."
  },
  {
    "label": "Relic‑Keeper/Curator",
    "description": "Guards potent artifacts or histories. Order and legacy motives; secrets about provenance are live wires."
  },
  {
    "label": "Scout‑Courier (Runner/Rider)",
    "description": "Speed as service. Duty and glory motives; arcs hinge on endurance, trust, and the message that must get through."
  },
  {
    "label": "Scribe/Calligrapher",
    "description": "Turns speech into record and art. Legacy and beauty motives; literacy is power, censorship the antagonist."
  },
  {
    "label": "Shipwright",
    "description": "Builds the means of exploration and commerce. Progress and security motives; every launch is a bet against chaos."
  },
  {
    "label": "Apothecary/Poisoner",
    "description": "Two faces of chemistry. Healing and power motives; ethics hinge on consent and context."
  },
  {
    "label": "Forester/Game Warden",
    "description": "Mediates human‑wild boundaries. Stewardship motives; conflict is poachers, politics, and climate."
  },
  {
    "label": "Teacher/Tutor",
    "description": "Shapes the next generation one mind at a time. Belief in others and legacy motives; impact measured in students, not applause."
  },
  {
    "label": "Quartermaster",
    "description": "Allocates scarce resources fairly. Security and justice motives; corruption tempts, transparency protects."
  },
  {
    "label": "Miner/Prospector",
    "description": "Digs wealth from darkness. Wealth and discovery motives; hazards externalize greed’s costs."
  },
  {
    "label": "Banker/Usurer",
    "description": "Turns trust into capital. Security and power motives; reputation hinges on fairness versus predation."
  },
  {
    "label": "Courier Guild Dispatcher",
    "description": "Moves people, packets, and secrets. Unity and logistics motives; a wrong route can start a war."
  },
  {
    "label": "Arena Promoter",
    "description": "Profits from spectacle. Wealth and glory motives; ethics wobble under blood and cheers."
  },
  {
    "label": "City Watch Captain",
    "description": "Frontline of civic order. Justice and order motives; politics squeeze from above while crime pushes from below."
  },
  {
    "label": "Brewer/Winemaker",
    "description": "Ferments culture and community. Craft and belonging motives; temperance advocates and scarcity test resolve."
  },
  {
    "label": "Street Orator/Agitator",
    "description": "Turns crowd into movement. Equality and revolution motives; reputation depends on what follows the speech."
  },
  {
    "label": "Undertaker/Mortician",
    "description": "Steward of endings and memory. Dignity and service motives; secrets surface when the dead cannot speak."
  }
]