[
  {
    "label": "Illegitimate Heir",
    "description": "They are the unacknowledged child of a ruler, a fact that could upend succession. The secret tempts ambition and triggers assassins; destiny hinges on whether they claim, expose, or bury the bloodline."
  },
  {
    "label": "Double Agent",
    "description": "They report to opposing sides, rationalizing that they serve peace—or only themselves. Every alliance is provisional; unmasking detonates reputation and resets the board."
  },
  {
    "label": "Past Murder",
    "description": "A killing hides beneath their civility: justified, accidental, or cold. Guilt or denial shapes every moral choice; truth-tellers circle like crows."
  },
  {
    "label": "Hidden Addiction",
    "description": "The habit is managed with alibis and charm until stress strips the cover. Blackmailers thrive on the secret; confession is both risk and cure."
  },
  {
    "label": "Forbidden Love",
    "description": "An affair across enemy lines, classes, or vows would destroy careers and families. The secret warps loyalties and fuels daring choices; exposure forces a reckoning between heart and duty."
  },
  {
    "label": "Cursed Bloodline",
    "description": "An ancestral pact stains descendants with powers or doom. The secret explains oddities but marks them for exploitation; disclosure invites hunters and zealots."
  },
  {
    "label": "Stolen Identity",
    "description": "They live under another’s name—refugee, impostor, or body-double. The borrowed life grants safety and access while eroding selfhood; truth will cost everything they’ve built."
  },
  {
    "label": "Fabricated Credentials",
    "description": "Degrees, titles, or feats are forged. Each success deepens the lie’s crater; a single skeptical auditor can collapse the structure."
  },
  {
    "label": "Hidden Child",
    "description": "A son or daughter is kept off the ledger to protect them—or the parent’s position. The secret creates leverage for enemies and fractures relationships when revealed."
  },
  {
    "label": "Treasonous Correspondence",
    "description": "Letters promise help to a rival nation in a moment of despair. The paper trail is a fuse that only time or theft can extinguish; burning it burns history."
  },
  {
    "label": "Pact with a Dark Power",
    "description": "A bargain traded years for gifts. The boon solves problems while the cost compounds; withdrawal may be fatal or redemptive."
  },
  {
    "label": "Staged Miracle",
    "description": "They faked a sign to rally a cause. Followers built lives atop it; truth could crush faith—or force a healthier one."
  },
  {
    "label": "Covert Illness",
    "description": "A degenerative disease or curse limits their span or capacity. Secrecy preserves command while endangering missions; succession plans become moral tests."
  },
  {
    "label": "Secret Marriage",
    "description": "A union concealed for politics, property, or grief. Estates, alliances, and heirs hinge on papers no one knows exist."
  },
  {
    "label": "Hidden Fortune",
    "description": "Money salted away—embezzled, inherited, or stolen—defines their freedom. Discovery reverses power dynamics and draws predators."
  },
  {
    "label": "Ruinous Debt",
    "description": "They are a heartbeat from financial collapse. Pride hides it; favors become chains; occupation choices narrow to desperation."
  },
  {
    "label": "War Crime",
    "description": "An atrocity committed or covered under orders. The secret rots leadership and splits the veteran community; truth is justice with shrapnel."
  },
  {
    "label": "Witness Bribery",
    "description": "They paid to sway testimony once. The ledger makes them obedient to whoever holds it; redemption requires public atonement."
  },
  {
    "label": "Broken Oath",
    "description": "A sacred vow was abandoned in private. The character performs piety in public while fearing divine or social exposure."
  },
  {
    "label": "Fake Death",
    "description": "They staged their demise to escape danger or punishment. Return complicates every relationship and ignites legal and spiritual questions."
  },
  {
    "label": "Noble Birth",
    "description": "They hide high blood to avoid politics—or because exile followed scandal. Revealing it opens doors and paint-targets simultaneously."
  },
  {
    "label": "Common Birth",
    "description": "They masquerade as noble in a world that worships pedigree. The lie buys voice but risks total erasure when revealed."
  },
  {
    "label": "Secret Pacifist in a Warrior Order",
    "description": "They refuse to kill but wear the blade. The secret guides creative tactics and invites fatal hesitation."
  },
  {
    "label": "Secret Killer in a Peace Order",
    "description": "They enforce order with hidden violence. The cognitive split corrodes empathy and invites exposure by a true believer."
  },
  {
    "label": "Concealed Patron",
    "description": "A powerful backer pulls strings anonymously. Gratitude and leash tangle; the source’s agenda will come due."
  },
  {
    "label": "Hidden Patronage",
    "description": "They bankroll a movement in the shadows. If purity is prized, exposure delegitimizes the cause and its figureheads."
  },
  {
    "label": "Sabotaged Trial",
    "description": "Evidence was planted or lost to ensure a verdict. Justice for one corrupted justice for all; the truth unravels careers."
  },
  {
    "label": "Secret Child of the Enemy",
    "description": "Blood ties cross the war line. The revelation fractures identity and command; destiny asks whom they save first."
  },
  {
    "label": "Concealed Massacre",
    "description": "They buried the site, the bodies, the orders. Ghosts—literal or political—will not stay underground."
  },
  {
    "label": "Counterfeit Relic",
    "description": "A revered object is a forgery they perpetuate. Faith, economy, and diplomacy rely on the lie; disclosure detonates more than a museum label."
  },
  {
    "label": "Ancestral Murder Weapon",
    "description": "The family heirloom killed someone important. Every ceremonial appearance risks recognition and revenge."
  },
  {
    "label": "Witchblood",
    "description": "Magic runs where law forbids it. The secret explains luck and oddities; exposure means pogroms or recruitment."
  },
  {
    "label": "Hidden Sanctuary",
    "description": "They maintain a safehouse for fugitives. The place is a beacon and a bullseye; betrayal would erase lives."
  },
  {
    "label": "Poisoner’s Hand",
    "description": "They are responsible for a string of subtle deaths framed as fate. Healthcare and court kitchens become battlefields of trust."
  },
  {
    "label": "Stolen Invention",
    "description": "A breakthrough credited to them was pilfered. Guilt and fear color mastery; the true creator is a ticking reappearance."
  },
  {
    "label": "Secret Language",
    "description": "They and a cabal communicate in a code no one else can read. It enables quiet coordination—and multiplies paranoia around them."
  },
  {
    "label": "Hidden Refugee Past",
    "description": "Paperwork erased a displaced childhood. Policy debates are personal; empathy and shame wrestle inside."
  },
  {
    "label": "Undeclared Faith",
    "description": "They pray to a banned god or philosophy. Rituals hide in daily habits; exposure threatens livelihood and life."
  },
  {
    "label": "Forbidden Book",
    "description": "They own and study a proscribed text. The ideas shape choices covertly; a raid would make thought itself a crime scene."
  },
  {
    "label": "Secret Benefactor",
    "description": "They rescue others anonymously. Humility protects ego while squandering political capital that could scale the help."
  },
  {
    "label": "Secret Extortion",
    "description": "They finance their cause by shaking the corrupt. It funds justice while reproducing rot; lines blur irrevocably."
  },
  {
    "label": "Hidden Heirloom Map",
    "description": "A route to power or safety is tucked in a keepsake. Everyone would kill to possess it; trust becomes the true treasure test."
  },
  {
    "label": "Buried Body",
    "description": "They know exactly where it lies—and how close erosion is. Every storm is a moral and literal threat."
  },
  {
    "label": "Secret Sterility",
    "description": "They cannot produce heirs in a lineage-obsessed culture. Intimacy and succession politics twist; compassion or cruelty defines partners."
  },
  {
    "label": "Concealed Conversion",
    "description": "They changed creeds quietly after a revelation. Old networks still expect obedience; new ones watch for wavering."
  },
  {
    "label": "Hidden Mentor",
    "description": "A banned teacher continues to guide them. Method and message remain alive in whispers; exposure would erase a school."
  },
  {
    "label": "Shadow Family",
    "description": "A second household relies on them. Love becomes logistics and lies; discovery collapses both homes."
  },
  {
    "label": "Covert Heist Crew",
    "description": "They are part of an ongoing theft ring with clean faces. Each job risks a chain reaction of arrests."
  },
  {
    "label": "Suppressed Prophecy",
    "description": "A vision about them was hidden by those afraid of it. Leaks redraw loyalties; self-fulfilling traps yawn."
  },
  {
    "label": "Hidden Lab",
    "description": "Experiments occur off the books, ethically gray or black. Breakthroughs tempt; containment failures threaten all."
  },
  {
    "label": "Counterfeiter",
    "description": "Their money or documents fuel revolutions and crime alike. Every transaction is both liberation and fraud."
  },
  {
    "label": "Secret Guardian",
    "description": "They protect a person who must never know. Purpose is pure; consent is missing; gratitude may never arrive."
  },
  {
    "label": "Concealed Marriage of State",
    "description": "A signature binds two powers in private. War and peace sway on a parchment that cannot be shown."
  },
  {
    "label": "Hidden Refuge",
    "description": "They retreat to a place no one else knows—mental health, illicit romance, or crime. The sanctuary becomes leverage once traced."
  },
  {
    "label": "Secret Labyrinth",
    "description": "They designed hidden routes through city or palace. Escape and infiltration tilt their way—until someone else learns the map."
  },
  {
    "label": "Smuggled Relatives",
    "description": "Family escaped through illegal means they arranged. Immigration status is a sword of Damocles; politics become personal minefields."
  },
  {
    "label": "Concealed Patron Saint",
    "description": "They attribute miracles to a false figure to hide the truth. Theology and power rest on a misdirection they authored."
  },
  {
    "label": "Hidden Familiar",
    "description": "A spirit or creature accomplice lives concealed. It explains odd competencies and accidents; exposure brands them sorcerous."
  },
  {
    "label": "Secret Charity Fraud",
    "description": "They siphon funds from a corrupt charity to actual need. Results are real; methods criminal; enemies own the narrative."
  },
  {
    "label": "Undeclared Weapon",
    "description": "They carry a proscribed tool at all times. Safety rides with risk; searches and rituals threaten exposure."
  },
  {
    "label": "Shadow Title",
    "description": "They hold a second office under an alias, steering outcomes. Conflicts of interest are unavoidable; collapse will be theatrical."
  },
  {
    "label": "Hidden Adoption",
    "description": "They are not the birth parent of a beloved child. Fear of rejection wars with truth’s claim to intimacy."
  },
  {
    "label": "Secret Archive",
    "description": "They keep records everyone else burned. History lives—and indicts—in their vault."
  },
  {
    "label": "Unpaid Blood Debt",
    "description": "A familial obligation stalks them across borders. Every victory is taxed by an old promise coming due."
  },
  {
    "label": "Concealed Kidnapping",
    "description": "They once abducted someone for a cause. The line between liberation and crime is thinner than their rhetoric."
  },
  {
    "label": "Phantom Ship/Company",
    "description": "They own an unregistered vessel or shell firm. It enables good or ill off-ledger; audits are existential threats."
  },
  {
    "label": "Hidden Banishment",
    "description": "A quiet exile underlies their relocation; official records lie. Returning home is trespass; staying away is a wound."
  },
  {
    "label": "Secret Duel",
    "description": "A private combat decided a public outcome. Honor and homicide blur; a second duel waits in the wings."
  },
  {
    "label": "False Paternity/Maternity Claim",
    "description": "They publicly claim a child for advantage. Truth makes lies into orphans; politics makes them into pawns."
  },
  {
    "label": "Bribed Gate",
    "description": "They bought entry—citizenship, guild, temple—with coin. The paper stands; the shame gnaws; enemies whisper."
  },
  {
    "label": "Covert Sanity Struggle",
    "description": "A mental-health battle is hidden under stoicism. Bottled symptoms erupt at the worst times; help is a reputational risk."
  },
  {
    "label": "Secret Language of Bells/Colors",
    "description": "They communicate through nonverbal systems others ignore. Power flows through pattern; discovery cracks every code they ever used."
  },
  {
    "label": "Suppressed Cure",
    "description": "They know a treatment the powerful quash. Saving lives requires exposing a cartel and themselves."
  },
  {
    "label": "Hidden Survivor Guilt",
    "description": "An ordinary choice saved them while others died. They repay a debt no one else signed; joy feels like theft."
  },
  {
    "label": "Undeclared Refuge Oath",
    "description": "They swore to shelter anyone who asks. The vow is beautiful—and logistically unsustainable."
  },
  {
    "label": "Secret Apostasy",
    "description": "They no longer believe, yet lead the faithful. The cognitive split corrodes them and their church; truth will remake both or break both."
  },
  {
    "label": "Hidden War Chest",
    "description": "Weapons or funds lie cached for a future crisis. The stash tempts preemptive war and invites thieves with maps."
  },
  {
    "label": "Covert Mentor to the Enemy’s Child",
    "description": "They teach their rival’s heir. Peace might be born; scandal certainly will be."
  },
  {
    "label": "Secret Pilgrimage",
    "description": "They travel incognito to holy or haunted sites. Insight grows where reputation cannot follow; risks do too."
  },
  {
    "label": "Concealed Executions",
    "description": "They signed death warrants under night seal. Justice or murder depends on truths no one else can now access."
  },
  {
    "label": "Hidden Name",
    "description": "A true name carries power; they guard it zealously. Lovers and summoners alike seek it; giving it is the ultimate trust."
  },
  {
    "label": "Secret Map in Music/Poetry",
    "description": "Their art encodes routes or plans. Audiences cheer while adversaries listen harder."
  },
  {
    "label": "Buried Treasure",
    "description": "A literal hoard lies where only they can find it. Needs today whisper; destiny tomorrow shouts."
  },
  {
    "label": "Hidden Twin",
    "description": "Another them walks the world—ally, rival, or stranger. Exploits and crimes swap owners; identity becomes chess."
  },
  {
    "label": "Secret Patron Killing",
    "description": "They ended the life of the one who raised them. Love, abuse, and necessity knot inextricably; truth undoes the self-narrative."
  },
  {
    "label": "Forbidden Science",
    "description": "They practice research banned for good reasons. Results call to them stronger than rules; consequences scale quickly."
  },
  {
    "label": "Concealed Noble Murder",
    "description": "They killed a highborn figure; politics, not justice, will decide their fate. Every courtly smile has a knife behind it."
  },
  {
    "label": "Hidden Debt to a Demon/Cartel",
    "description": "Payment day approaches with compound interest. Choices narrow to crime, confession, or miracle."
  },
  {
    "label": "Secret Orchard/Graveyard",
    "description": "A tended place hides either contraband life or contraband death. Seasons themselves threaten disclosure."
  },
  {
    "label": "Hidden Dynasty Ledger",
    "description": "A book of crimes keeps a house in line. Possession is leverage; loss is ruin."
  },
  {
    "label": "Undeclared Heirloom Weapon",
    "description": "A relic blade or wand makes them lethal and liable. Ceremonies and searches are gauntlets."
  },
  {
    "label": "Fake Prophetic Trance",
    "description": "They staged visions once and got stuck as oracle. Politics learned to depend on their theater."
  },
  {
    "label": "Secret Diplomatic Channel",
    "description": "Peace or war can hinge on their backdoor talks. One leak ends careers and countries."
  },
  {
    "label": "Concealed Sterilization of a People",
    "description": "They were part of a eugenic crime. The truth is a war by itself; silence is complicity continued."
  },
  {
    "label": "Hidden Exile of a Lover",
    "description": "They arranged a partner’s disappearance for safety—or convenience. Reunion is loaded with truth’s bill."
  },
  {
    "label": "Secret Adoption by a Monster",
    "description": "A supernatural entity claims parenthood. Protection and predation blur; identity rewrites under moonlight."
  },
  {
    "label": "Undeclared Royal Guard",
    "description": "They serve in plain clothes, oath-bound. Every hallway is a battlefield; relationships are operational cover."
  },
  {
    "label": "Hidden Plague Carrier",
    "description": "They are asymptomatic but dangerous. Conscience, medicine, and secrecy tear them in three."
  },
  {
    "label": "Secret Immortality",
    "description": "They do not age and cannot easily die. Attachment is agony; history is witness; enemies learn patterns."
  },
  {
    "label": "Concealed Time Crime",
    "description": "They altered an event and remember both timelines. Contradictions accumulate; reality collects debts."
  }
]