[
  {
    "label": "Love vs. Duty",
    "description": "The heart pulls one way while obligation pulls another. Resolution defines identity: traitor, martyr, or reconciler who redefines duty."
  },
  {
    "label": "Freedom vs. Security",
    "description": "Craving autonomy while fearing uncertainty. Growth is building systems that protect without imprisoning."
  },
  {
    "label": "Justice vs. Mercy",
    "description": "Balancing accountability with compassion. The answer changes case by case; wisdom is the arc."
  },
  {
    "label": "Faith vs. Doubt",
    "description": "Belief and skepticism wrestle for sovereignty. Honest doubt purifies faith; brittle certainty shatters when tested."
  },
  {
    "label": "Loyalty vs. Truth",
    "description": "Protecting a person versus speaking reality. Choosing truth may betray someone; choosing loyalty may betray many."
  },
  {
    "label": "Ambition vs. Integrity",
    "description": "Rising without selling out, or staying small to stay clean. The character defines success by who they become to get it."
  },
  {
    "label": "Self‑Preservation vs. Altruism",
    "description": "Survival instincts clash with sacrificial love. Boundaries make sustainable heroism possible."
  },
  {
    "label": "Control vs. Surrender",
    "description": "Managing every variable versus accepting limits. Peace appears when influence replaces illusion."
  },
  {
    "label": "Revenge vs. Forgiveness",
    "description": "Pain’s demand for payment against healing’s invitation. The choice writes the ending’s tone."
  },
  {
    "label": "Isolation vs. Belonging",
    "description": "Safety in solitude against nourishment in community. The arc asks who is worth the risk of being known."
  },
  {
    "label": "Tradition vs. Progress",
    "description": "Honoring ancestors versus adapting for the living. Integration is rare and valuable when achieved."
  },
  {
    "label": "Idealism vs. Pragmatism",
    "description": "Purity of aim versus usefulness of means. The mature stance is principled pragmatism—not either extreme."
  },
  {
    "label": "Autonomy vs. Connection",
    "description": "Independence colliding with intimacy’s demands. Healthy bonds allow individuality inside togetherness."
  },
  {
    "label": "Reason vs. Emotion",
    "description": "Analysis against gut and empathy. Great decisions invite both to the table."
  },
  {
    "label": "Courage vs. Caution",
    "description": "Bold action against measured risk. Mastery is knowing when each is correct."
  },
  {
    "label": "Honesty vs. Harmony",
    "description": "Telling hard truths versus preserving peace. Delivery, timing, and consent turn conflict into growth."
  },
  {
    "label": "Power vs. Service",
    "description": "Leading for status versus leading for others. The test is who benefits from every choice."
  },
  {
    "label": "Purity vs. Compassion",
    "description": "Uncompromised standards versus mercy for human mess. The arc humanizes the ideal without abandoning it."
  },
  {
    "label": "Loyalty to Family vs. Loyalty to Cause",
    "description": "Blood ties against mission vows. The hierarchy chosen reveals core identity."
  },
  {
    "label": "Hope vs. Realism",
    "description": "Expecting good versus planning for bad. The synthesis is hopeful realism that invests without naivete."
  },
  {
    "label": "Pride vs. Humility",
    "description": "Claiming worth without eclipsing others. Growth is confidence with open ears."
  },
  {
    "label": "Desire vs. Principle",
    "description": "Wanting what one’s values forbid. Temptation scenes test the lived reality of the code."
  },
  {
    "label": "Vocation vs. Relationship",
    "description": "Work calling against the people who make life worth it. Boundaries and rhythms decide what survives."
  },
  {
    "label": "Forgiveness of Self vs. Penitence",
    "description": "Letting go against perpetual penance. True amends enable release; self‑punishment immobilizes."
  },
  {
    "label": "Secrecy vs. Transparency",
    "description": "Privacy’s protection versus trust’s requirement. Calibrated disclosure is the adult solution."
  },
  {
    "label": "Stability vs. Growth",
    "description": "Keeping the current peace against risking improvement. Stagnation wears a calm mask; courage experiments."
  },
  {
    "label": "Authenticity vs. Acceptance",
    "description": "Being true versus being welcomed. The arc asks whether the room that demands disguise is worth staying in."
  },
  {
    "label": "Justice for the Many vs. Mercy for the One",
    "description": "Policy versus person in front of you. The character learns when exceptions prove the rule—and when they break it."
  },
  {
    "label": "Duty to Past vs. Duty to Future",
    "description": "Honoring promises versus opening possibilities. The pivot is discerning which debts must be paid and which can be forgiven."
  },
  {
    "label": "Seizing Power vs. Sharing Power",
    "description": "Efficiency against inclusion. Long‑term outcomes reveal the wiser choice."
  },
  {
    "label": "Trust vs. Self‑Protection",
    "description": "Letting others in versus guarding the heart. Healing is risking wisely—testing, then opening."
  },
  {
    "label": "Forging Identity vs. Carrying Legacy",
    "description": "Defining self anew against inherited roles. The journey names what to keep and what to lay down."
  },
  {
    "label": "Truth‑Telling vs. Strategic Silence",
    "description": "Speaking now versus waiting for greater effect. Timing turns courage into effectiveness."
  },
  {
    "label": "Justice vs. Peace",
    "description": "Punishing harm versus ending violence. Sometimes you cannot have both; priorities expose values."
  },
  {
    "label": "Loyalty to Leader vs. Loyalty to Principle",
    "description": "Following a person against following an idea. The moment they diverge is the crucible."
  },
  {
    "label": "Sacrifice vs. Self‑Care",
    "description": "Giving beyond comfort against preserving capacity to keep giving. Sustainability is a moral stance, not selfishness."
  }
]